#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.ecs.random_id.target_group_sufix: Refreshing state... [id=HCk]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:909067940010:cluster/dev-ecs-cluster]
module.ecs.aws_iam_role.ecs_autoscale_role: Refreshing state... [id=dev_ecs_autoscale_role]
module.ecs.aws_cloudwatch_log_group.rails_terraform: Refreshing state... [id=rails_terraform]
module.networking.aws_vpc.vpc: Refreshing state... [id=vpc-0372897f2b2cf0013]
module.ecs.aws_ecr_repository.rails_terraform_app: Refreshing state... [id=rails_terraform/production]
module.ecs.aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_task_execution_role]
module.ecs.aws_iam_role.ecs_role: Refreshing state... [id=ecs_role]
module.ecs.aws_iam_role_policy.ecs_autoscale_role_policy: Refreshing state... [id=dev_ecs_autoscale_role:ecs_autoscale_role_policy]
module.ecs.aws_iam_role_policy.ecs_service_role_policy: Refreshing state... [id=ecs_role:ecs_service_role_policy]
module.ecs.aws_iam_role_policy.ecs_execution_role_policy: Refreshing state... [id=ecs_task_execution_role:ecs_execution_role_policy]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0fbf87ba9c7643d5b]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-04374972f1d8d7766]
module.networking.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-0f57143846728ee5c]
module.networking.aws_security_group.default: Refreshing state... [id=sg-0738cc11d05581be9]
module.rds.aws_security_group.db_access_sg: Refreshing state... [id=sg-0570cd6e606aee37f]
module.networking.aws_internet_gateway.ig: Refreshing state... [id=igw-050268770474b5d25]
module.networking.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-0ae1ad08e11dba8fc]
module.networking.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0f7236048387a2dc4]
module.networking.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-02ee4dfbc542dc269]
module.ecs.aws_security_group.web_inbound_sg: Refreshing state... [id=sg-0968de984297b19e7]
module.ecs.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/dev-alb-target-group-1c29/6774c0174f17355a]
module.ecs.aws_security_group.ecs_service: Refreshing state... [id=sg-0a3caf9cc6d9a2395]
module.rds.aws_security_group.rds_sg: Refreshing state... [id=sg-039016d1f08c57724]
module.rds.aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=dev-rds-subnet-group]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bd8a2ca784ac01ef]
module.ecs.aws_alb.alb_rails-terraform: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:909067940010:loadbalancer/app/dev-alb-rails-terraform/22a8b2da49a4f32f]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-085ec5207205c49e3]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-043215d80d1183667]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0184d48288293b7a1]
module.networking.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-04374972f1d8d77661080289494]
module.networking.aws_eip.nat_eip: Refreshing state... [id=eipalloc-02117492c82a1a66f]
module.networking.aws_nat_gateway.nat: Refreshing state... [id=nat-0e8874c86c3097210]
module.ecs.aws_alb_listener.rails_terraform: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:909067940010:listener/app/dev-alb-rails-terraform/22a8b2da49a4f32f/2671923612532e1f]
module.networking.aws_route.private_nat_gateway: Refreshing state... [id=r-rtb-0fbf87ba9c7643d5b1080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ecs.aws_alb_listener.rails_terraform has been changed
  ~ resource "aws_alb_listener" "rails_terraform" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:909067940010:listener/app/dev-alb-rails-terraform/22a8b2da49a4f32f/2671923612532e1f"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.ecs.aws_ecr_repository.rails_terraform_app has been changed
  ~ resource "aws_ecr_repository" "rails_terraform_app" {
        id                   = "rails_terraform/production"
        name                 = "rails_terraform/production"
      + tags                 = {}
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.ecs.aws_ecs_cluster.cluster has been changed
  ~ resource "aws_ecs_cluster" "cluster" {
      + capacity_providers = []
        id                 = "arn:aws:ecs:us-east-2:909067940010:cluster/dev-ecs-cluster"
        name               = "dev-ecs-cluster"
      + tags               = {}
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.ecs.aws_iam_role.ecs_autoscale_role has been changed
  ~ resource "aws_iam_role" "ecs_autoscale_role" {
        id                    = "dev_ecs_autoscale_role"
        name                  = "dev_ecs_autoscale_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "ecs_autoscale_role_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecs:DescribeServices",
                              + "ecs:UpdateService",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "cloudwatch:DescribeAlarms",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # module.ecs.aws_alb_target_group.alb_target_group has been changed
  ~ resource "aws_alb_target_group" "alb_target_group" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/dev-alb-target-group-1c29/6774c0174f17355a"
        name                               = "dev-alb-target-group-1c29"
      + tags                               = {}
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.ecs.aws_iam_role.ecs_execution_role has been changed
  ~ resource "aws_iam_role" "ecs_execution_role" {
        id                    = "ecs_task_execution_role"
        name                  = "ecs_task_execution_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "ecs_execution_role_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchCheckLayerAvailability",
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:BatchGetImage",
                              + "logs:CreateLogStream",
                              + "logs:PutLogEvents",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # module.ecs.aws_iam_role.ecs_role has been changed
  ~ resource "aws_iam_role" "ecs_role" {
        id                    = "ecs_role"
        name                  = "ecs_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "ecs_service_role_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
                              + "elasticloadbalancing:Describe*",
                              + "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
                              + "ec2:Describe*",
                              + "ec2:AuthorizeSecurityGroupIngress",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = ""
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # module.networking.aws_route_table.private has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0fbf87ba9c7643d5b"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0e8874c86c3097210"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-private-route-table"
        }
        # (5 unchanged attributes hidden)
    }
  # module.networking.aws_eip.nat_eip has been changed
  ~ resource "aws_eip" "nat_eip" {
      + association_id       = "eipassoc-0471db74911f28a33"
        id                   = "eipalloc-02117492c82a1a66f"
      + network_interface    = "eni-02b105d3feb86c4f3"
      + private_dns          = "ip-10-0-1-47.us-east-2.compute.internal"
      + private_ip           = "10.0.1.47"
      + tags                 = {}
        # (7 unchanged attributes hidden)
    }
  # module.networking.aws_route_table.public has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-04374972f1d8d7766"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-050268770474b5d25"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-public-route-table"
        }
        # (5 unchanged attributes hidden)
    }
  # module.networking.aws_security_group.default has been changed
  ~ resource "aws_security_group" "default" {
        id                     = "sg-0738cc11d05581be9"
        name                   = "dev-default-sg"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }
  # module.rds.aws_db_subnet_group.rds_subnet_group has been changed
  ~ resource "aws_db_subnet_group" "rds_subnet_group" {
        id          = "dev-rds-subnet-group"
        name        = "dev-rds-subnet-group"
      + tags        = {}
        # (4 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.data.aws_ecs_task_definition.web will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "web"  {
      + family          = (known after apply)
      + id              = (known after apply)
      + network_mode    = (known after apply)
      + revision        = (known after apply)
      + status          = (known after apply)
      + task_definition = "dev_web"
      + task_role_arn   = (known after apply)
    }

  # module.ecs.data.template_file.db_migrate_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "db_migrate_task"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + command          = [
                      + "bundle",
                      + "exec",
                      + "rake",
                      + "db:migrate",
                    ]
                  + environment      = [
                      + {
                          + name  = "RAILS_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "DATABASE_URL"
                          + value = "${database_url}"
                        },
                      + {
                          + name  = "SECRET_KEY_BASE"
                          + value = "${secret_key_base}"
                        },
                      + {
                          + name  = "RAILS_LOG_TO_STDOUT"
                          + value = "true"
                        },
                    ]
                  + image            = "${image}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${log_group}"
                          + awslogs-region        = "${region}"
                          + awslogs-stream-prefix = "db_migrate"
                        }
                    }
                  + memory           = 300
                  + name             = "db-migrate"
                },
            ]
        )
      + vars     = {
          + "database_url"    = (known after apply)
          + "image"           = "909067940010.dkr.ecr.us-east-2.amazonaws.com/rails_terraform/production"
          + "log_group"       = "rails_terraform"
          + "region"          = "us-east-2"
          + "secret_key_base" = "8d412aee3ceaa494fe1c276f5f7e524b9e33f649c03690e689e5b36a0cf4ce2a6f50024bc31f276c22b668e619d61a42b79f5e595759f377a8fa373e2907f41e"
        }
    }

  # module.ecs.data.template_file.web_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "web_task"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "RAILS_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "DATABASE_URL"
                          + value = "${database_url}"
                        },
                      + {
                          + name  = "SECRET_KEY_BASE"
                          + value = "${secret_key_base}"
                        },
                      + {
                          + name  = "PORT"
                          + value = "80"
                        },
                      + {
                          + name  = "RAILS_LOG_TO_STDOUT"
                          + value = "true"
                        },
                      + {
                          + name  = "RAILS_SERVE_STATIC_FILES"
                          + value = "true"
                        },
                    ]
                  + image            = "${image}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${log_group}"
                          + awslogs-region        = "${region}"
                          + awslogs-stream-prefix = "web"
                        }
                    }
                  + memory           = 300
                  + name             = "web"
                  + networkMode      = "awsvpc"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "database_url"    = (known after apply)
          + "image"           = "public.ecr.aws/bitnami/rails:latest"
          + "log_group"       = "rails_terraform"
          + "region"          = "us-east-2"
          + "secret_key_base" = "8d412aee3ceaa494fe1c276f5f7e524b9e33f649c03690e689e5b36a0cf4ce2a6f50024bc31f276c22b668e619d61a42b79f5e595759f377a8fa373e2907f41e"
        }
    }

  # module.ecs.aws_appautoscaling_policy.down will be created
  + resource "aws_appautoscaling_policy" "down" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev_scale_down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/dev-ecs-cluster/dev-web"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.up will be created
  + resource "aws_appautoscaling_policy" "up" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev_scale_up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/dev-ecs-cluster/dev-web"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.target will be created
  + resource "aws_appautoscaling_target" "target" {
      + id                 = (known after apply)
      + max_capacity       = 4
      + min_capacity       = 2
      + resource_id        = "service/dev-ecs-cluster/dev-web"
      + role_arn           = "arn:aws:iam::909067940010:role/dev_ecs_autoscale_role"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.ecs.aws_cloudwatch_metric_alarm.service_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "dev_rails_terraform_web_cpu_utilization_high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "dev-ecs-cluster"
          + "ServiceName" = "dev-web"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # module.ecs.aws_ecs_service.web will be created
  + resource "aws_ecs_service" "web" {
      + cluster                            = "arn:aws:ecs:us-east-2:909067940010:cluster/dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dev-web"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "web"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/dev-alb-target-group-1c29/6774c0174f17355a"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0570cd6e606aee37f",
              + "sg-0738cc11d05581be9",
              + "sg-0a3caf9cc6d9a2395",
            ]
          + subnets          = [
              + "subnet-02ee4dfbc542dc269",
              + "subnet-0f57143846728ee5c",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.db_migrate will be created
  + resource "aws_ecs_task_definition" "db_migrate" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
      + family                   = "dev_db_migrate"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + task_role_arn            = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
    }

  # module.ecs.aws_ecs_task_definition.web will be created
  + resource "aws_ecs_task_definition" "web" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
      + family                   = "dev_web"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + task_role_arn            = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
    }

  # module.networking.aws_eip.nat_eip will be updated in-place
  ~ resource "aws_eip" "nat_eip" {
        id                   = "eipalloc-02117492c82a1a66f"
        tags                 = {}
      ~ tags_all             = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
        # (10 unchanged attributes hidden)
    }

  # module.rds.aws_db_instance.rds will be created
  + resource "aws_db_instance" "rds" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "dev-rds-subnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "13.3"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "dev-database"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = "railsterraform_dev"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + timezone                              = (known after apply)
      + username                              = "railsterraform"
      + vpc_security_group_ids                = [
          + "sg-039016d1f08c57724",
        ]
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @bsneider, Action: `pull_request`*